tsung.conf.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung>
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>
  <servers>
    <server host="localhost" port="5678" type="tcp"/>
  </servers>
  <load>
    <arrivalphase phase="1" duration="5" unit="minute">
      <users interarrival="3" unit="second"/>
    </arrivalphase>
  </load>
  <sessions>
    <session name="rec20161001-2252" probability="100" type="ts_http">
      <request>
        <http url="http://localhost:5678/" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/index.css" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="http://localhost:5678/index.js" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/favicon.ico" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="http://localhost:5678/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:true}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" contents="{&quot;power&quot;:false}" content_type="application/x-www-form-urlencoded; charset=UTF-8" method="POST"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="2"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
      <thinktime random="true" value="1"/>
      <request>
        <http url="/humidifier" version="1.1" method="GET"/>
      </request>
    </session>
  </sessions>
</tsung>